mdhardenburgh/Blinky/Packages/.cache/NXP.LPC55S66_DFP.12.0.0.pdsc
        __errorcontrol = 1;

        // Execute SYSRESETREQ via AIRCR
        Write32(AIRCR_Addr, 0x05FA0004);

        __errorcontrol = 0;

        // Give bootloader time to do what it needs to do
        DAP_Delay(BootTime);  // try 10ms

        Sequence("WaitForStopAfterReset");
      </block>
        </sequence>
        <sequence name="ResetSystemCore1" disable="1"/>
        <sequence name="ResetProcessorCore0" disable="1"/>
        <sequence name="ResetProcessorCore1">
          <block>
        __var SYSCON_NS_Base_Addr = 0x40000000;
        __var CPUCTRL_Addr        = SYSCON_NS_Base_Addr + 0x800;
        __var value               = 0;
        __var apOrg               = __ap;

        __ap = 0;                           // Switch to CPU0 AP to drive CPU1 reset via CPUCTRL register

        value      = Read32(CPUCTRL_Addr);  // Read CPUCTRL Register
        value &amp;= 0x0000FFFF;            // Preserve previous settings
        value     |= 0xC0C40000;            // Set key value
        value     |= 0x00000028;            // Set CPU1CLKEN and CPU1RSTEN
        Write32(CPUCTRL_Addr, value);       // Put CPU1 into reset

        value &amp;= ~0x00000020;           // Clear CPU1RSTEN
        Write32(CPUCTRL_Addr, value);       // Release CPU1 from reset

        __ap = apOrg;
      </block>
        </sequence>
        <sequence name="TraceStart">
          <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
            <block>
          Sequence("EnableTraceClk");       // Enable and configure trace clock
        </block>
            <control if="SWO_Pin == 0" info="SWO via PIO0_10">
              <block>
            Write32(0x40001028, 0x00000046); // Configure PIO0_10: FUNC - 6, MODE - 0, SLEW - 1, INVERT - 0, DIGMODE - 0, OD - 0
          </block>
            </control>
            <control if="SWO_Pin == 1" info="SWO via PIO0_8">
              <block>
            Write32(0x40001020, 0x00000044); // Configure PIO0_10: FUNC - 4, MODE - 0, SLEW - 1, INVERT - 0, DIGMODE - 0, OD - 0
          </block>
            </control>
          </control>
        </sequence>
      </sequences>
      <debugvars configfile="arm/LPC55xx.dbgconf">
  // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
  __var SWO_Pin               = 0;                    // Serial Wire Output pin: 0 = PIO0_10, 1 = PIO0_8
  __var Dbg_CR                = 0x00000000;           // DBG_CR
  __var BootTime              = 10000;                // 10 milliseconds
</debugvars>
      <description>The LPC55xx/LPC55Sxx is an ARM Cortex M33 based micro-controller for embedded applications. These devices include up to 320 KB of on-chip SRAM, up to 640 KB on-chip flash, high-speed and full-speed USB host and device interface with crystal-less operation for full-speed, five general-purpose timers, one SCTimer/PWM, one RTC/alarm timer, one 24-bit Multi-Rate Timer (MRT), a Windowed Watchdog Timer (WWDT), eight flexible serial communication peripherals (each of which can be a USART, SPI, I2C, or I2S interface), one 16-bit 1.0 Msamples/sec ADC, temperature sensor.</description>
      <device Dname="LPC55S66">
        <processor Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="100000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/LPC55S66_flash.icf"/>
        </environment>
        <sequences>
          <sequence name="DebugDeviceUnlock">
            <block>
          Sequence("DebugDeviceUnlockCore0");
      </block>
          </sequence>
          <sequence name="ResetCatchSet">
            <block>
          Sequence("ResetCatchSetCore0");
      </block>
          </sequence>
          <sequence name="ResetSystem">
            <block>
          Sequence("ResetSystemCore0");
      </block>
          </sequence>
        </sequences>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x050000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x20000000" size="0x024000" access="rw" default="1"/>
        <memory name="SRAMX" start="0x04000000" size="0x8000" access="rw" default="1"/>
        <memory name="USB_RAM" start="0x40100000" size="0x4000" access="rw" default="1"/>
        <algorithm name="arm/LPC55XX_640.FLM" start="0x00000000" size="0x00098000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="LPC55S66.xml" __dp="0" __ap="0"/>
        <variant Dvariant="LPC55S66JBD100">
          <compile header="fsl_device_registers.h" define="CPU_LPC55S66JBD100"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC55S66JBD100/LPC55S66_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="LPC55S66JET98">
          <compile header="fsl_device_registers.h" define="CPU_LPC55S66JET98"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/LPC55S66JET98/LPC55S66_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="LPC55S66*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.LPC55S66_AND_component.serial_manager_uart_AND_component.usart_adapter_AND_device.LPC55S66_startup_AND_driver.clock_AND_driver.common_AND_driver.flexcomm_i2c_AND_driver.flexcomm_spi_AND_driver.flexcomm_usart_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.reset_AND_utility.debug_console">
      <accept Dname="LPC55S66*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC55S66_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
    </condition>
